tests/benchmark/results/perf/ab_select_c50_r1.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            10839

Document Path:          /hello
Document Length:        12 bytes

Concurrency Level:      50
Time taken for tests:   2.649 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      3850000 bytes
HTML transferred:       600000 bytes
Requests per second:    18874.19 [#/sec] (mean)
Time per request:       2.649 [ms] (mean)
Time per request:       0.053 [ms] (mean, across all concurrent requests)
Transfer rate:          1419.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0      10
Processing:     0    2   1.2      2      12
Waiting:        0    2   1.2      1      12
Total:          1    3   1.3      2      14
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      3
  75%      3
  80%      3
  90%      4
  95%      5
  98%      7
  99%      8
 100%     14 (longest request)